Revit 2026 API

# FamilySizeTableManager Properties

---

The FamilySizeTableManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSizeTables | The number of FamilySizeTables in a family. |

#### Reference

FamilySizeTableManager Class

Autodesk.Revit.DB Namespace